In [1]:
import pandas as pd;

In [5]:
data = pd.read_csv('titanic_dataset.csv')

In [6]:
data.shape

(55, 12)

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,0,2,Passenger 4,male,24,1,0,TKT44,16.0000,NaN,C
4,5,1,3,Passenger 5,female,25,2,1,TKT55,17.5000,NaN,Q

In [9]:
data.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,Passenger 8,male,28,2,0,TKT88,22.0,NaN,Q
41,42,0,1,Passenger 42,male,32,0,0,TKT462,73.0,NaN,S
29,30,0,1,Passenger 30,male,20,0,0,TKT330,55.0,NaN,S
38,39,1,1,Passenger 39,female,29,0,1,TKT429,68.5,NaN,S
26,27,1,1,Passenger 27,female,47,0,1,TKT297,50.5,NaN,S

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  55 non-null     int64
 1   Survived     55 non-null     int64
 2   Pclass       55 non-null     int64
 3   Name         55 non-null     object
 4   Sex          55 non-null     object
 5   Age          55 non-null     int64
 6   SibSp        55 non-null     int64
 7   Parch        55 non-null     int64
 8   Ticket       55 non-null     object
 9   Fare         55 non-null     float64
 10  Cabin        1 non-null      object
 11  Embarked     55 non-null     object
dtypes: float64(1), int64(6), object(5)
memory usage: 5.3+ KB

In [12]:
data.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          54
Embarked        0
dtype: int64

In [13]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,55.00000,55.000000,55.000000,55.000000,55.000000,55.000000,55.000000
mean,28.00000,0.509091,2.018182,34.181818,0.981818,0.472727,52.862878
std,16.02082,0.504525,0.827556,7.897705,0.804867,0.503857,23.918675
min,1.00000,0.000000,1.000000,20.000000,0.000000,0.000000,7.250000
25%,14.50000,0.000000,1.000000,27.500000,0.000000,0.000000,33.250000
50%,28.00000,1.000000,2.000000,34.000000,1.000000,0.000000,53.500000
75%,41.50000,1.000000,3.000000,40.500000,2.000000,1.000000,72.250000
max,55.00000,1.000000,3.000000,49.000000,2.000000,1.000000,92.500000

In [14]:
data.duplicated().sum()

np.int64(0)